SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/main.c
            /* Restore status LEDs */
            BSP_LED_Off(LED_RED);
            BSP_LED_On(LED_GREEN);

            /* Wait for button release */
            while (HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_13) == GPIO_PIN_SET)
                vTaskDelay(pdMS_TO_TICKS(50));
        }

        vTaskDelay(pdMS_TO_TICKS(BTN_POLL_DELAY_MS));
    }
}

static void insect_detection_task(void *arg)
{
    (void)arg;

    /* ---- Wait for ToF sensor to be fully initialized by main_thread ---- */
    while (!tof_ready) {
        vTaskDelay(pdMS_TO_TICKS(500));
    }

    printf("\n============================================\n");
    printf("  INSECT DETECTION TASK — STARTING\n");
    printf("  ToF sensor already initialized.\n");
    printf("============================================\n\n");

    uint32_t capture_count = 0;
    uint32_t cooldown_frames = 0;
    const uint32_t COOLDOWN_FRAMES_VALUE = 30;

    /* ---- Debug output counter ---- */
    static uint32_t debug_frame_count = 0;

    while (1) {
        /* ---- Update detection module ---- */
        if (!VL53L5CX_Update()) {
            vTaskDelay(pdMS_TO_TICKS(10));
            continue;
        }

        /* ---- Check cooldown ---- */
        if (cooldown_frames > 0) cooldown_frames--;

        /* ---- Insect detected? ---- */
        if (VL53L5CX_IsInsectDetected() && cooldown_frames == 0) {
            VL53L5CX_DetectionResult_t result = VL53L5CX_GetResult();

            /* Determine trigger source string */
            const char *trig_str;
            switch (result.trigger_source) {
                case VL53L5CX_TRIG_SIGNAL: trig_str = "signal"; break;
                case VL53L5CX_TRIG_MOTION: trig_str = "motion"; break;
                case VL53L5CX_TRIG_BOTH:   trig_str = "signal+motion"; break;
                default:                    trig_str = "unknown"; break;
            }

            printf(">>> INSECT DETECTED! Trigger: %s (%u zones)\n",
                   trig_str, result.affected_count);

            /* ---- TRIGGER CAMERA CAPTURE ---- */
            printf("    Triggering camera capture...\n");
            BSP_LED_Off(LED_GREEN);
            BSP_LED_On(LED_RED);
            WS2812_TurnOn();
            vTaskDelay(pdMS_TO_TICKS(100));

            int rc = CAM_CaptureSingleFrame(capture_buf, MAX_SNAP_FRAME_SIZE,
                                            SNAP_WIDTH, SNAP_HEIGHT,
                                            SNAP_FPS, SNAP_WARMUP_FRAMES);

            if (rc == 0) {
                uint32_t frame_size = (uint32_t)SNAP_WIDTH * SNAP_HEIGHT * 2UL;
                uint32_t total_blocks = (SD_IMG_HEADER_SIZE + frame_size + SD_BLOCK_SIZE - 1) / SD_BLOCK_SIZE;
                uint32_t target_block = snap_base_block + (capture_count * total_blocks);
                uint32_t saved_base = SD_IMG_BASE_BLOCK;
                SD_IMG_BASE_BLOCK = target_block;

                if (SD_StoreRawImage(capture_buf, frame_size, SNAP_WIDTH, SNAP_HEIGHT, 0) == 0) {
                    capture_count++;
                    printf("    >>> Snapshot #%lu SAVED!\n", (unsigned long)capture_count);
                } else {
                    printf("    [ERROR] SD write failed!\n");
                }
                SD_IMG_BASE_BLOCK = saved_base;
            } else {
                printf("    [ERROR] Camera capture failed (rc=%d)!\n", rc);
            }

            BSP_LED_Off(LED_RED);
            BSP_LED_On(LED_GREEN);
            WS2812_TurnOff();
            cooldown_frames = COOLDOWN_FRAMES_VALUE;
            printf("    Cooldown: %d frames (%.1f seconds)\n\n",
                   COOLDOWN_FRAMES_VALUE, (float)COOLDOWN_FRAMES_VALUE / 15.0f);
        }
    }
}

/* ================================================================
   SECTION 15: FREERTOS INITIALIZATION
   ================================================================ */

/**
 * @brief  Create and start FreeRTOS tasks
 *
 *         Creates two static tasks:
 *         - main_thread (priority 2): Board initialization, then deletes itself
 *         - btn_thread  (priority 3): Button polling and capture loop
 */
static int main_freertos(void)
{
    TaskHandle_t hdl;

    hdl = xTaskCreateStatic(main_thread_fct, "main",
                            configMINIMAL_STACK_SIZE, NULL,
                            tskIDLE_PRIORITY + 1,
                            main_thread_stack, &main_thread_cb);
    assert(hdl != NULL);

    /* Create insect detection task (priority: IDLE+2 - higher than button) */
    hdl = xTaskCreateStatic(insect_detection_task, "insect",
                            4 * configMINIMAL_STACK_SIZE, NULL,
                            tskIDLE_PRIORITY + 2,
                            insect_thread_stack, &insect_thread_cb);
    assert(hdl != NULL);

    /* Button task at HIGHER priority for immediate response */
    hdl = xTaskCreateStatic(btn_thread_fct, "btn",
                            4 * configMINIMAL_STACK_SIZE, NULL,
                            tskIDLE_PRIORITY + 2,
                            btn_thread_stack, &btn_thread_cb);
    assert(hdl != NULL);

    vTaskStartScheduler();
    assert(0);
    return -1;
}


/* ================================================================
   SECTION 16: MAIN THREAD (runs once: board init, then deletes)
   ================================================================ */

/**
 * @brief  Main initialization task
 *
 *         Performs all hardware initialization in sequence:
 *         1. NVIC priorities
 *         2. System clock
 *         3. Debug console
 *         4. Fuse programming
 *         5. WS2812 illumination (DMA + TIM)
 *         6. VL53L5CX ToF sensor (I2C + GPIO)
 *         7. PSRAM (XSPI RAM + NOR)
 *         8. LEDs + User button
 *         9. Security + IAC config
 *         10. Low-power clock gates
 *         11. SD card init + benchmark
 *         12. Set system_ready flag, delete task
 */
static void main_thread_fct(void *arg)
{
    (void)arg;
    uint32_t preemptPriority, subPriority;
    IRQn_Type i;
    int ret;

    /* ---- NVIC Priority Configuration ---- */
    HAL_NVIC_GetPriority(SysTick_IRQn, HAL_NVIC_GetPriorityGrouping(),
                         &preemptPriority, &subPriority);
    for (i = PVD_PVM_IRQn; i <= LTDC_UP_ERR_IRQn; i++)
        HAL_NVIC_SetPriority(i, preemptPriority, subPriority);

    /* ---- Clocks + Console + Fuses ---- */
    SystemClock_Config();
    vPortSetupTimerInterrupt();
    CONSOLE_Config();
    Fuse_Programming();

